-- phpMyAdmin SQL Dump
-- version 2.11.6-rc1
-- http://www.phpmyadmin.net
--
-- Host: mysql.leotsar.cz8.ru
-- Generation Time: Feb 20, 2012 at 09:02 PM
-- Server version: 5.5.1
-- PHP Version: 5.2.17

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `db_leotsar_1`
--

-- --------------------------------------------------------

--
-- Table structure for table `ki_sub_regions`
--

CREATE TABLE IF NOT EXISTS `ki_sub_regions` (
  `sub_region_id` int(11) NOT NULL AUTO_INCREMENT,
  `sub_region_name` varchar(100) NOT NULL DEFAULT '',
  `sub_region_disp_name` varchar(20) NOT NULL DEFAULT '',
  `region_id` int(11) NOT NULL DEFAULT '0',
  PRIMARY KEY (`sub_region_id`),
  KEY `region_id` (`region_id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=46 ;

--
-- Dumping data for table `ki_sub_regions`
--

INSERT INTO `ki_sub_regions` (`sub_region_id`, `sub_region_name`, `sub_region_disp_name`, `region_id`) VALUES
(1, 'Санкт-Петербург', 'СПб', 2),
(2, 'Ленинградская область', 'СПб', 2),
(3, 'Москва', 'Мск', 3),
(4, 'Московская область', 'Мск', 3),
(5, 'Тверская область', 'Тверь', 3),
(6, 'Владимирская область', 'Влад', 3),
(7, 'Архангельская область', 'Арх', 2),
(8, 'Новгородская область', 'Новг', 2),
(9, 'Карелия', 'Карел', 2),
(10, 'Коми', 'Коми', 2),
(11, 'Вологодская область', 'Волог', 2),
(12, 'Калининградская область', 'Клнград', 2),
(13, 'Мурманская область', 'Мурм', 2),
(14, 'Псковская область', 'Псков', 2),
(15, 'Ненецкий автономный округ', 'Ненец', 2),
(17, 'Татарстан', 'Казань', 1),
(18, 'Томская область', 'Томск', 1),
(19, 'Республика Башкортостан', 'Бшк', 5),
(20, 'Нижегородская область', 'Нижн', 1),
(21, 'Самарская область', 'Смр', 1),
(22, 'Тульская область', 'Тула', 3),
(23, 'Рязанская область', 'Ряз', 3),
(24, 'Свердловская область', 'Сврд', 5),
(25, 'Челябинская область', 'Члб', 5),
(26, 'Орловская область', 'Орёл', 3),
(27, 'Калужская область', 'Калуга', 3),
(28, 'Пермский край', 'Пермь', 5),
(29, 'Оренбургская область', 'Орен', 5),
(30, 'Тюменская область', 'Тюмень', 5),
(31, 'Курганская область', 'Кург', 5),
(32, 'Курская область', 'Курск', 3),
(33, 'Белгородская область', 'Белг', 3),
(34, 'Воронежская область', 'Врнж', 3),
(35, 'Ханты-Мансийский автономный округ', 'ХМАО', 5),
(36, 'Ямало-Ненецкий автономный округ', 'ЯНАО', 5),
(37, 'Ярославская область', 'Яров', 3),
(38, 'Красноярский край', 'Крс', 5),
(39, 'Новосибирская область', 'Нвсиб', 6),
(40, 'Адыгея', 'Адг', 7),
(41, 'Астраханская область', 'Астрх', 7),
(42, 'Волгоградская область', 'Влгр', 7),
(43, 'Калмыкий', 'Клмк', 7),
(44, 'Ростовская область', 'Рств', 7),
(45, 'Краснодарский край', 'Крас', 7),
(46, 'Ставропольский Край', 'Стврп', 7);
