-- phpMyAdmin SQL Dump
-- version 2.11.6-rc1
-- http://www.phpmyadmin.net
--
-- Host: mysql.leotsar.cz8.ru
-- Generation Time: Apr 06, 2013 at 05:51 PM
-- Server version: 5.5.1
-- PHP Version: 5.2.17

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";

--
-- Database: `db_leotsar_9`
--

-- --------------------------------------------------------

--
-- Table structure for table `ki_sub_regions`
--

CREATE TABLE IF NOT EXISTS `ki_sub_regions` (
  `sub_region_id` int(11) NOT NULL AUTO_INCREMENT,
  `sub_region_name` varchar(100) NOT NULL DEFAULT '',
  `sub_region_disp_name` varchar(20) NOT NULL DEFAULT '',
  `region_id` int(11) NOT NULL DEFAULT '0',
  PRIMARY KEY (`sub_region_id`),
  KEY `region_id` (`region_id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=78 ;

--
-- Dumping data for table `ki_sub_regions`
--

INSERT INTO `ki_sub_regions` (`sub_region_id`, `sub_region_name`, `sub_region_disp_name`, `region_id`) VALUES
(1, 'Санкт-Петербург', 'СПб', 2),
(2, 'Ленинградская область', 'СПб', 2),
(3, 'Москва', 'Мск', 3),
(4, 'Московская область', 'Мск', 3),
(5, 'Тверская область', 'Тверь', 3),
(6, 'Владимирская область', 'Влад', 3),
(7, 'Архангельская область', 'Арх', 2),
(8, 'Новгородская область', 'Новг', 2),
(9, 'Карелия', 'Карел', 2),
(10, 'Коми', 'Коми', 2),
(11, 'Вологодская область', 'Волог', 2),
(12, 'Калининградская область', 'Клнград', 2),
(13, 'Мурманская область', 'Мурм', 2),
(14, 'Псковская область', 'Псков', 2),
(15, 'Ненецкий автономный округ', 'Ненец', 2),
(17, 'Татарстан', 'Казань', 9),
(18, 'Томская область', 'Томск', 6),
(19, 'Башкортостан', 'Бшк', 9),
(20, 'Нижегородская область', 'Нижн', 9),
(21, 'Самарская область', 'Смр', 9),
(22, 'Тульская область', 'Тула', 3),
(23, 'Рязанская область', 'Ряз', 3),
(24, 'Свердловская область', 'Сврд', 5),
(25, 'Челябинская область', 'Члб', 5),
(26, 'Орловская область', 'Орёл', 3),
(27, 'Калужская область', 'Калуга', 3),
(28, 'Пермский край', 'Пермь', 9),
(29, 'Оренбургская область', 'Орен', 9),
(30, 'Тюменская область', 'Тюм', 5),
(31, 'Курганская область', 'Кург', 5),
(32, 'Курская область', 'Курск', 3),
(33, 'Белгородская область', 'Белг', 3),
(34, 'Воронежская область', 'Врнж', 3),
(35, 'Ханты-Мансийский автономный округ', 'ХМАО', 5),
(36, 'Ямало-Ненецкий автономный округ', 'ЯНАО', 5),
(37, 'Ярославская область', 'Яров', 3),
(38, 'Красноярский край', 'Крс', 6),
(39, 'Новосибирская область', 'Нвсиб', 6),
(40, 'Адыгея', 'Адг', 7),
(41, 'Астраханская область', 'Астрх', 7),
(42, 'Волгоградская область', 'Влгр', 7),
(43, 'Калмыкий', 'Клмк', 7),
(44, 'Ростовская область', 'Рств', 7),
(45, 'Краснодарский край', 'Крсдар', 7),
(46, 'Ставропольский Край', 'Стврп', 7),
(47, 'Тамбовская область', 'Тмбв', 3),
(48, 'Бурятия', 'Бурят', 6),
(49, 'Алтай (Республика)', 'Алт', 6),
(50, 'Забайкальский край', 'Збкл', 6),
(51, 'Хакасия', 'Хкс', 6),
(52, 'Тыва', 'Тыв', 6),
(53, 'Алтайский край', 'Алткр', 6),
(59, 'Саха (Якутия)', 'Якт', 8),
(55, 'Иркутская область', 'Иркт', 6),
(56, 'Кемеровская область', 'Кмрв', 6),
(57, 'Омская область', 'Омск', 6),
(60, 'Хабаровский край', 'Хабр', 8),
(61, 'Амурская область', 'Амур', 8),
(62, 'Камчатский край', 'Камч', 8),
(63, 'Магаданская область', 'Магад', 8),
(64, 'Сахалинская область', 'Схлн', 8),
(65, 'Еврейская автономная область', 'ЕАО', 8),
(66, 'Чукотский автономный округ', 'ЧАО', 8),
(67, 'Приморский край', 'Влдвст', 8),
(68, 'Костромская область', 'Костром', 3),
(69, 'Ижевская область', 'Ижв', 9),
(70, 'Кировская область', 'Крв', 9),
(71, 'Республика Марий Эл', 'МрЭл', 9),
(72, 'Мордовия', 'Мрдв', 9),
(73, 'Пензенская область', 'Пенза', 9),
(74, 'Саратовская область', 'Сртв', 9),
(75, 'Удмуртская республика', 'Удмрт', 9),
(76, 'Ульяновская область', 'Улвн', 9),
(77, 'Чувашская область', 'Чвш', 9);
