--
-- PostgreSQL database dump
--

\restrict UdopVpuIDHh8co3XPVcwMBSMuAtoxWlYPUVxJW92SLyxBxNWYt9Eo375M2LMIqT

-- Dumped from database version 15.18 (Ubuntu 15.18-201-yandex.55830.ec642aad1f)
-- Dumped by pg_dump version 15.18 (Debian 15.18-1.pgdg13+1)

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

--
-- Data for Name: ki_game_types; Type: TABLE DATA; Schema: public; Owner: -
--

COPY public.ki_game_types (game_type_id, game_type_name, show_all_regions, game_type_style, game_type_real_game) FROM stdin;
1	Полевая	0		1
2	Городская	0		1
3	На&nbsp;турбазе	0		1
4	Павильонная	0		0
5	Конвент	1		0
6	Бал	0		0
7	Маневры	0		0
8	Городская + Полевая	0		1
9	Городская + На турбазе	0		1
10	Турнир	0		0
11	Подземная	0		1
12	Страйкбол	0		0
13	Фестиваль	0		0
\.


--
-- Data for Name: ki_regions; Type: TABLE DATA; Schema: public; Owner: -
--

COPY public.ki_regions (region_id, region_name, region_code, region_experimental) FROM stdin;
1	Все игры		0
2	Северо-Запад	spb	0
3	Москва и Центральный регион	msk	0
5	Урал	ural	0
6	Сибирь	sibir	0
7	Юг России	south	0
8	Дальний Восток	dv	0
9	Поволжье	volga	0
10	Украина	ua	0
11	Беларусь	bel	0
13	Зарубежье	foreign	0
\.


--
-- Data for Name: ki_status; Type: TABLE DATA; Schema: public; Owner: -
--

COPY public.ki_status (status_id, status_name, status_style, problem_status, future_only_status, cancelled_status, show_review_flag, show_date_flag, good_status) FROM stdin;
0	OK	status-ok	0	1	0	1	1	1
1	Прошла	status-finish	0	0	0	1	1	1
2	???	status-unknown	1	0	0	0	1	0
3	Отложена	status-postponedd	0	0	1	0	1	0
4	Дата?	status-date	1	0	0	0	0	0
5	Отменена	status-canceled	0	0	1	0	1	0
\.


--
-- Data for Name: ki_sub_regions; Type: TABLE DATA; Schema: public; Owner: -
--

COPY public.ki_sub_regions (sub_region_id, sub_region_name, sub_region_disp_name, region_id) FROM stdin;
1	Санкт-Петербург	СПб	2
2	Ленинградская область	СПб	2
3	Москва	Мск	3
4	Московская область	Мск	3
5	Тверская область	Тверь	3
6	Владимирская область	Влад	3
7	Архангельская область	Арх	2
8	Новгородская область	Новг	2
9	Карелия	Карел	2
10	Коми	Коми	2
11	Вологодская область	Волог	2
12	Калининградская область	Клнград	2
13	Мурманская область	Мурм	2
14	Псковская область	Псков	2
15	Ненецкий автономный округ	Ненец	2
17	Татарстан	Казань	9
18	Томская область	Томск	6
19	Башкортостан	Бшк	5
20	Нижегородская область	Нижн	9
21	Самарская область	Смр	9
22	Тульская область	Тула	3
23	Рязанская область	Ряз	3
24	Свердловская область	Сврд	5
25	Челябинская область	Члб	5
26	Орловская область	Орёл	3
27	Калужская область	Калуга	3
28	Пермский край	Пермь	5
29	Оренбургская область	Орен	9
30	Тюменская область	Тюм	5
31	Курганская область	Кург	5
32	Курская область	Курск	3
33	Белгородская область	Белг	3
34	Воронежская область	Врнж	3
35	Ханты-Мансийский автономный округ	ХМАО	5
36	Ямало-Ненецкий автономный округ	ЯНАО	5
37	Ярославская область	Ярслвль	3
38	Красноярский край	Крс	6
39	Новосибирская область	Нвсиб	6
40	Адыгея	Адг	7
41	Астраханская область	Астрх	7
42	Волгоградская область	Влгр	7
44	Ростовская область	Рств	7
45	Краснодарский край	Крсдар	7
46	Ставропольский Край	Стврп	7
47	Тамбовская область	Тмбв	3
48	Бурятия	Бурят	6
49	Алтай (Республика)	Алт	6
50	Забайкальский край	Збкл	6
51	Хакасия	Хкс	6
52	Тыва	Тыв	6
53	Алтайский край	Алткр	6
59	Саха (Якутия)	Якт	8
55	Иркутская область	Иркт	6
56	Кемеровская область	Кмрв	6
57	Омская область	Омск	6
60	Хабаровский край	Хабр	8
61	Амурская область	Амур	8
62	Камчатский край	Камч	8
63	Магаданская область	Магад	8
64	Сахалинская область	Схлн	8
65	Еврейская автономная область	ЕАО	8
66	Чукотский автономный округ	ЧАО	8
67	Приморский край	Приморье	8
68	Костромская область	Костром	3
69	Ижевская область	Ижв	9
70	Кировская область	Крв	9
71	Республика Марий Эл	МрЭл	9
72	Мордовия	Мрдв	9
73	Пензенская область	Пенза	9
74	Саратовская область	Сртв	9
75	Удмуртская республика	Удмрт	9
76	Ульяновская область	Улвн	9
77	Чувашская область	Чвш	9
78	Республика Крым	Крым	7
79	Винницкая область	Винница	10
80	Волынская область	Волынь	10
81	Днепропетровская область	Днепр	10
83	Житомирская область	Житомир	10
84	Закарпатская область	Закарпаты	10
86	Ивано-Франковская область	И-Франк	10
87	Киевская область	Киев	10
88	Кировоградская область	Кирвгрд	10
90	Львовская область	Львов	10
82	Донецкая народная республика	ДНР	7
85	Запорожская область	Запорожье	7
43	Калмыкия	Клмк	7
91	Николаевская область	Николаевск	10
92	Одесская область	Одесса	10
93	Полтавская область	Полтава	10
94	Ровненская область	Ровно	10
95	Сумская область	Сумы	10
96	Тернопольская область	Тернополь	10
97	Харьковская область	Харьков	10
99	Хмельницкая область	Хмель	10
100	Черкасская область	Черкас	10
101	Черниговская область	Чернигов	10
102	Черновицкая область	Черновицк	10
103	Севастополь	Севпль	7
104	Смоленская область	Смоленск	3
106	Брестская область	Брест	11
107	Витебская область	Витебск	11
108	Гомельская область	Гомель	11
109	Гродненская область	Гродно	11
110	Минская область	Минск	11
111	Могилёвская область	Могилёв	11
112	Ивановская область	Иванов	3
113	Липецкая область	Лпцк	3
114	Астана	Астана	12
115	Алматы	Алматы	12
116	Байконур	Байконур	12
117	Акмолинская область	Акмол	12
118	Актюбинская область	Актюбы	12
119	Алматинская область	Алмат. обл	12
120	Атырауская область	Атырау	12
121	Восточно-Казахстанская область	Восток Кзхстн	12
122	Жамбылская область	Жамбыл	12
123	Западно-Казахстанская область	Запад Кзхстн	12
124	Карагандинская область	Караганда	12
125	Костанайская область	Костанай	12
126	Кызылординская область	Қызылорда	12
127	Мангистауская область	Мангист	12
128	Павлодарская область	Павлодар	12
129	Северо-Казахстанская область	Север Кзхстн	12
130	Южно-Казахстанская область	Юг Кзхстн	12
89	Луганская народная республика	ЛНР	7
98	Херсонская область	Херсон	7
131	Армения	Армения	13
132	Казахстан	Казахстан	13
133	Киргизия	Киргизия	13
134	Молдавия	Молдавия	13
135	Таджикистан	Таджикистан	13
136	Узбекистан	Узбекистан	13
137	Великобритания	UK	13
138	Дания	Дания	13
139	Ирландия	Ирландия	13
140	Исландия	Исландия	13
141	Латвия	Латвия	13
142	Литва	Литва	13
143	Норвегия	Норвегия	13
144	Финляндия	Финляндия	13
145	Швеция	Швеция	13
146	Эстония	Эстония	13
147	Венгрия	Венгрия	13
148	Грузия	Грузия	13
149	Польша	Польша	13
150	Словакия	Словакия	13
151	Чехия	Чехия	13
152	Австрия	Австрия	13
153	Бельгия	Бельгия	13
154	Германия	ФРГ	13
155	Нидерланды	Нидерланды	13
156	Франция	Франция	13
157	Швейцария	Швейцария	13
158	Албания	Албания	13
159	Болгария	Болгария	13
160	Греция	Греция	13
161	Румыния	Румыния	13
162	Северная Македония	Северная Македония	13
163	Сербия	Сербия	13
164	Словения	Словения	13
165	Турция	Турция	13
166	Хорватия	Хорватия	13
167	Черногория	Черногория	13
168	Испания	Испания	13
169	Италия	Италия	13
170	Республика Кипр	Республика Кипр	13
171	Португалия	Португалия	13
172	Франция	Франция	13
173	Израиль	Израиль	13
174	Брянская область	Брянск	3
\.


--
-- Data for Name: ki_update_types; Type: TABLE DATA; Schema: public; Owner: -
--

COPY public.ki_update_types (ki_update_type_id, ki_update_type_name, update_type_polygon_flag, update_type_game_flag, update_type_photo_flag, update_type_review_flag, advertise_update_flag, update_type_user_text) FROM stdin;
1	Добавлена новая игра	0	1	0	0	1	игра %game%
2	Изменено описание игры	0	1	0	0	0	\N
3	Игра удалена из календаря	0	1	0	0	0	\N
5	Изменена дата игры	0	1	0	0	0	\N
6	Добавлена новость	0	0	0	0	1	на сайте:
7	Игра восстановлена в календаре	0	1	0	0	0	\N
8	У игры изменился статус	0	1	0	0	0	\N
9	Удален полигон	1	0	0	0	0	\N
10	Добавлен новый полигон	1	0	0	0	0	\N
11	Полигон переименован	1	0	0	0	0	\N
12	Полигон восстановлен	1	0	0	0	0	\N
13	Добавлена новая рецензия	0	1	0	1	1	%review_link% на игру %game% от %updated_user%
14	Удалена рецензия	0	1	0	1	0	\N
15	Добавлен фотоотчет	0	1	1	0	1	%photo% к игре %game% от %updated_user%
16	Изменен фотоотчет	0	1	1	0	0	\N
17	Удален фотоотчет	0	1	1	0	0	\N
18	Автор ассоциирован с ЖЖ	0	0	0	0	0	\N
19	Игра добавлена пользователем	0	1	0	0	0	\N
20	Игра проверена редактором	0	1	0	0	1	игра %game%
21	Рецензия восстановлена	0	1	0	1	0	\N
\.


--
-- Data for Name: privs; Type: TABLE DATA; Schema: public; Owner: -
--

COPY public.privs (id, name, "desc", hidden_flag) FROM stdin;
1	BASTILIA_NEWS	Новости на Бастилии	1
2	USERS_CONTROL	Администратор пользователей	0
3	VIEW_SPB_GAMES	Приватные игры в СПБ	1
4	EDIT_GAMES	Редактор календаря	0
5	EDIT_POLYGONS	Редактор полигонов	0
6	PHOTO	Фотомодератор	0
7	PHOTO_SELF	Доверенный фотограф	0
\.


--
-- Name: ki_game_types_game_type_id_seq; Type: SEQUENCE SET; Schema: public; Owner: -
--

SELECT pg_catalog.setval('public.ki_game_types_game_type_id_seq', 13, true);


--
-- Name: ki_regions_region_id_seq; Type: SEQUENCE SET; Schema: public; Owner: -
--

SELECT pg_catalog.setval('public.ki_regions_region_id_seq', 13, true);


--
-- Name: ki_sub_regions_sub_region_id_seq; Type: SEQUENCE SET; Schema: public; Owner: -
--

SELECT pg_catalog.setval('public.ki_sub_regions_sub_region_id_seq', 174, true);


--
-- Name: ki_update_types_ki_update_type_id_seq; Type: SEQUENCE SET; Schema: public; Owner: -
--

SELECT pg_catalog.setval('public.ki_update_types_ki_update_type_id_seq', 21, true);


--
-- Name: privs_id_seq; Type: SEQUENCE SET; Schema: public; Owner: -
--

SELECT pg_catalog.setval('public.privs_id_seq', 7, true);


--
-- PostgreSQL database dump complete
--

\unrestrict UdopVpuIDHh8co3XPVcwMBSMuAtoxWlYPUVxJW92SLyxBxNWYt9Eo375M2LMIqT

